tap "azure/functions"
tap "confluentinc/confluent-hub-client"
tap "daviderestivo/emacs-head"
tap "hashicorp/tap"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "railwaycat/emacsmacport"
brew "bash-completion"
brew "ghc"
brew "cabal-install"
brew "glib"
brew "python@3.9"
brew "cloc"
brew "cmake"
brew "coreutils"
brew "eksctl"
brew "libtool"
brew "erlang"
brew "elixir"
brew "fd"
brew "nettle"
brew "unbound"
brew "gnutls"
brew "harfbuzz"
brew "libarchive"
brew "libbluray"
brew "pango"
brew "tesseract"
brew "ffmpeg"
brew "fzf"
brew "gcc"
brew "gdk-pixbuf"
brew "gh"
brew "ghostscript"
brew "git"
brew "git-delta"
brew "go"
brew "python@3.11"
brew "gobject-introspection"
brew "netpbm"
brew "librsvg"
brew "graphviz"
brew "grep"
brew "guile"
brew "htop"
brew "shared-mime-info"
brew "libheif"
brew "python@3.8"
brew "libraw"
brew "imagemagick"
brew "imagemagick@6"
brew "jq"
brew "kompose"
brew "kubernetes-cli"
brew "kubectx"
brew "libxml2"
brew "netcat"
brew "nghttp2"
brew "node", link: false
brew "pandoc"
brew "qemu"
brew "podman"
brew "postgresql@14"
brew "virtualenv"
brew "pre-commit"
brew "python@3.10"
brew "redis"
brew "ripgrep"
brew "scriptcs"
brew "railwaycat/emacsmacport/emacs-mac"
cask "amethyst"
cask "font-juliamono"
cask "godot"
cask "google-cloud-sdk"
cask "iterm2"
cask "keycastr"
cask "rectangle"
vscode "AdsonCicilioti.yaru-vscode"
vscode "ahmadawais.shades-of-purple"
vscode "amodio.tsl-problem-matcher"
vscode "bceskavich.theme-dracula-at-night"
vscode "bierner.markdown-mermaid"
vscode "dbaeumer.vscode-eslint"
vscode "dracula-theme.theme-dracula"
vscode "formulahendry.code-runner"
vscode "GitHub.copilot"
vscode "GitHub.github-vscode-theme"
vscode "golang.go"
vscode "hashicorp.terraform"
vscode "haskell.haskell"
vscode "hediet.debug-visualizer"
vscode "hoovercj.vscode-power-mode"
vscode "humao.rest-client"
vscode "jcanero.hoogle-vscode"
vscode "jdinhlife.gruvbox"
vscode "jock.svg"
vscode "justusadam.language-haskell"
vscode "kahole.magit"
vscode "kameshkotwani.google-search"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csharp"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.hexeditor"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vsliveshare.vsliveshare"
vscode "ms-vsts.team"
vscode "nwolverson.ide-purescript"
vscode "nwolverson.language-purescript"
vscode "oderwat.indent-rainbow"
vscode "rebornix.prolog"
vscode "RobbOwen.synthwave-vscode"
vscode "slevesque.shader"
vscode "vscodevim.vim"
vscode "Vue.volar"
vscode "Vue.vscode-typescript-vue-plugin"
vscode "webrender.synthwave-x-fluoromachine"
vscode "zhuangtongfa.material-theme"
