tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "railwaycat/emacsmacport"
brew "ghc"
brew "cabal-install"
brew "cloc"
brew "erlang"
brew "elixir"
brew "gnutls"
brew "harfbuzz"
brew "fzf"
brew "gcc"
brew "gh"
brew "git"
brew "git-delta"
brew "go"
brew "gobject-introspection"
brew "graphviz"
brew "grep"
brew "htop"
brew "imagemagick"
brew "imagemagick@6"
brew "jq"
brew "kubernetes-cli"
brew "kubectx"
brew "neovim"
brew "netcat"
brew "pandoc"
brew "podman"
brew "virtualenv"
brew "pre-commit"
brew "ripgrep"
brew "railwaycat/emacsmacport/emacs-mac"
brew "fnm" # Node version manager
cask "amethyst"
cask "font-juliamono"
cask "google-cloud-sdk"
cask "iterm2"
cask "keycastr"
cask "rectangle"
vscode "ahmadawais.shades-of-purple"
vscode "bceskavich.theme-dracula-at-night"
vscode "bierner.markdown-mermaid"
vscode "dbaeumer.vscode-eslint"
vscode "dracula-theme.theme-dracula"
vscode "formulahendry.code-runner"
vscode "GitHub.copilot"
vscode "GitHub.github-vscode-theme"
vscode "golang.go"
vscode "hashicorp.terraform"
vscode "haskell.haskell"
vscode "hediet.debug-visualizer"
vscode "hoovercj.vscode-power-mode"
vscode "humao.rest-client"
vscode "jcanero.hoogle-vscode"
vscode "jdinhlife.gruvbox"
vscode "jock.svg"
vscode "justusadam.language-haskell"
vscode "kahole.magit"
vscode "kameshkotwani.google-search"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.hexeditor"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vsliveshare.vsliveshare"
vscode "ms-vsts.team"
vscode "nwolverson.ide-purescript"
vscode "nwolverson.language-purescript"
vscode "oderwat.indent-rainbow"
vscode "rebornix.prolog"
vscode "RobbOwen.synthwave-vscode"
vscode "slevesque.shader"
vscode "vscodevim.vim"
vscode "Vue.volar"
vscode "Vue.vscode-typescript-vue-plugin"
vscode "webrender.synthwave-x-fluoromachine"
vscode "zhuangtongfa.material-theme"
